# ThermalMass Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..ThermalMass Property
SpecTypeId Class See Also
---
Thermal Mass, in discipline Energy.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId ThermalMass { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ThermalMass As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ThermalMass {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace